Autodesk.Revit.DB.Geolocation.Services.ILoadGeolocationServer.LoadGeolocation(Autodesk.Revit.DB.Geolocation.Services.LoadGeolocationData)
Create and fill in a GeolocationBase based on the specified Json.

Autodesk.Revit.DB.Geolocation.Services.ILoadGeolocationServer.LoadDerivedGeolocation(Autodesk.Revit.DB.Geolocation.Services.LoadGeolocationData)
Create and fill in a DerivedGeolocation based on the collection of JSONData.

Autodesk.Revit.DB.Geolocation.Services.ILoadGeolocationServer
Interface class for external server implementing loading of geolocation.
Remarks:
A typical way to use the external server can be:
Implement a server class that derives from this interface Create a new server object and register it with the service, see ExternalServiceRegistry.